# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [3]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [40]:
s = ([1,np.nan,'Pandas libray'])
s1 = pd.Series(s)
s1

0                1
1              NaN
2    Pandas libray
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [41]:
s2 = np.array([2,np.nan, 'b'])
s2 = pd.Series(s2)
s2

0      2
1    nan
2      b
dtype: object

### <center> Method 2: Using a List

In [42]:
list1 = ['animal', '2','animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [43]:
list2 = ['3', 'c','Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [44]:
s5 = pd.Series(
    {'A':1,
    '3': 'Python',
    })
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [45]:
s6 = pd.Series(
    {'Integer':3,
    'B':'Boys'
    })
s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [46]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0 -0.110666  0.117550 -1.763422  0.443832
1  0.113389 -0.619056  0.927204 -1.149710
2 -0.365052 -0.000806  0.023346  0.249942
3  0.986310 -0.955658 -1.366442  0.748208
4 -1.766873  0.641320 -1.404622  1.133749
5 -0.774610 -1.204464  0.011301 -1.532434

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [47]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0  1.415679 -2.776911  1.235307
1  1.108909  1.314977 -0.414447
2  0.376534  1.321780 -0.174145

### <center> Method 2: Passing a Dictionary of Objects

In [48]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3,dtype='int32'),
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [49]:
df3= pd.DataFrame({
    'E':np.array([4]*5,dtype='int32'),
    'Day':2,
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [21]:
df4 = pd.read_csv('/home/rhyme/Desktop/Project/practicedata.csv')
df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [23]:
df5 = pd.read_json('/home/rhyme/Desktop/Project/practicedata.json')
df5.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

##### Importing Files from a url

Import data from this github repo: ")
https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv

In [24]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [27]:
df7 =pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

##### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

## <center> Export Files

### Export .csv Files

In [29]:
df4.to_csv('/home/rhyme/Desktop/Project/practicedata2.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [30]:
df4.to_json('/home/rhyme/Desktop/Project/practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [31]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [32]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [33]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [34]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [ ]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

In [35]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [37]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [ ]:
df7.dtypes

## <center>Handling Duplicates

### Detect Duplicate Rows

In [38]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [39]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [40]:
#Detect duplicates
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [41]:
#Drop duplicates
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [42]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [43]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [44]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [45]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [7]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0 -0.953968  0.518073 -0.536308 -0.085191
1 -1.219519 -1.052261 -0.920048 -0.715182
2 -0.601180 -0.409705 -1.147205  0.327114
3 -1.238907 -0.143273 -0.531145 -0.430973
4 -1.410919 -1.085923  0.167026  1.121532
5  0.303743 -0.347554 -0.077652 -0.034495

### Calculate the Mean:

In [8]:
df8.mean()

0   -0.853458
1   -0.420107
2   -0.507555
3    0.030468
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [9]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0  0.693603  1.764259 -0.304227 -0.145562
1  0.214256 -1.471664  0.566239 -1.255935
2 -0.310746 -0.665669 -0.259013 -0.638777

In [10]:
df9.mean()

0    0.199037
1   -0.124358
2    0.001000
3   -0.680091
dtype: float64

### Calculate the Cumulative Sum:

In [11]:
df8.apply(np.cumsum)

          0         1         2         3
0 -0.953968  0.518073 -0.536308 -0.085191
1 -2.173487 -0.534188 -1.456356 -0.800373
2 -2.774667 -0.943893 -2.603561 -0.473259
3 -4.013574 -1.087166 -3.134706 -0.904232
4 -5.424493 -2.173089 -2.967680  0.217300
5 -5.120750 -2.520643 -3.045332  0.182805

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [12]:
df9.apply(np.cumsum)

          0         1         2         3
0  0.693603  1.764259 -0.304227 -0.145562
1  0.907859  0.292595  0.262012 -1.401497
2  0.597112 -0.373074  0.003000 -2.040274

### Find the Maximum Value:

In [14]:
df8.max()

0    0.303743
1    0.518073
2    0.167026
3    1.121532
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [15]:
df9.max()

0    0.693603
1    1.764259
2    0.566239
3   -0.145562
dtype: float64

### Find the Minimum Value:

In [16]:
df8.min()

0   -1.410919
1   -1.085923
2   -1.147205
3   -0.715182
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [17]:
df9.min()

0   -0.310746
1   -1.471664
2   -0.304227
3   -1.255935
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [18]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [21]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [22]:
s8 = np.array(['cat','dog', 'Python Programming'])
s8 = pd.Series(s8)
s8

0                   cat
1                   dog
2    Python Programming
dtype: object

In [23]:
s8.str.lower()

0                   cat
1                   dog
2    python programming
dtype: object

---------------

### Convert to Upper Case

In [24]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [25]:
s8.str.upper()

0                   CAT
1                   DOG
2    PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [26]:
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [27]:
s8.str.swapcase()

0                   CAT
1                   DOG
2    pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [28]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [29]:
s8.str.len()

0     3
1     3
2    18
dtype: int64

-------------

### Split String

In [30]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [31]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [32]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [33]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [34]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [35]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [37]:
repeat_list=[2,3,2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [38]:
s8 = np.array(['cat','dog','Python Programming'])
s8 =pd.Series(s8)
s8

0                   cat
1                   dog
2    Python Programming
dtype: object

In [39]:
repeat_list=[1,2,3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2    Python ProgrammingPython ProgrammingPython Pro...
dtype: object